Repository: HACK-THE-WORLD/IDAPluginList
Catalog: Gepetto/gepetto-locales/*/LC_MESSAGES/gepetto.po
Languages: it_it

source: Explain function
it_it: Descrivi la funzione

source: Rename variables
it_it: Rinomina le variabili

source: Uses gpt-3.5-turbo to enrich the decompiler's output
it_it: Usa gpt-3.5-turbo per arricchire il codice decompilato

source: See usage instructions on GitHub
it_it: Consulta le istruzioni d'uso su GitHub

source: Use gpt-3.5-turbo to explain the currently selected function
it_it: Usa gpt-3.5-turbo per descrivere la funzione selezionata

source: Use gpt-3.5-turbo to rename this function's variables
it_it: Usa gpt-3.5-turbo per rinominare le variabili di questa funzione

source: Comment generated by Gepetto
it_it: Commento generato da Geppetto

source: gpt-3.5-turbo query finished!
it_it: gpt-3.5-turbo query completata!

source: Can you explain what the following C function does and suggest a better name for it? {decompiler_output}
it_it: Potresti descrivere cosa fa la seguente funzione e suggerire un nome migliore? {decompiler_output}

source: Could not obtain valid data from the model, giving up. Dumping the response for manual import:
it_it: Impossibile ottenere dati validi dal modello. L'operazione è stata interrotta. Riporto di seguito la risposta per l'importazione manuale:

source: Cannot extract valid JSON from the response. Asking the model to fix it...
it_it: Impossibile estrarre un JSON valido dalla risposta. Chiedo al modello di aggiustarlo...

source: The JSON document returned is invalid. Asking the model to fix it...
it_it: Il documento JSON ottenuto non è valido. Chiedo al modello di aggiustarlo...

source: Please fix the following JSON document:
it_it: Per favore aggiusta il seguente documento JSON:

source: The JSON document provided in this response is invalid. Can you fix it? {response}
it_it: Il documento JSON fornito in questa risposta non è valido. Potresti aggiustarlo? {response}

source: gpt-3.5-turbo query finished! {replaced} variable(s) renamed.
it_it: gpt-3.5-turbo query terminata! {replaced} variabili rinominate.

source: Analyze the following C function: {decompiler_output} Suggest better variable names, reply with a JSON array where keys are the original names and values are the proposed names. Do not explain anything, only print the JSON dictionary.
it_it: Analizza la funziona C: {decompiler_output} Suggerisci dei nomi variabili migliori, rispondi con un JSON array in cui le chiavi sono i nomi originali ed i valori sono i nomi suggeriti. Non spiegare nulla, limitati a stampare il dizionario JSON.

source: gpt-3.5-turbo could not complete the request: {error}
it_it: gpt-3.5-turbo non può soddisfare la richiesta: {error}

source: Context length exceeded! Reducing the completion tokens to {max_tokens}...
it_it: Lunghezza massima del contenuto superata! Riprova riducendo il numero dei token di completamento a {max_tokens}...

source: Unfortunately, this function is too big to be analyzed with the model's current API limits.
it_it: Sfortunatamente, questa funzione è troppo grande per essere analizzata con gli attuali limiti API del modello.

source: General exception encountered while running the query: {error}
it_it: Eccezione rilevata durante l'esecuzione della query: {error}

source: Request to gpt-3.5-turbo sent...
it_it: Richiesta inviata a gpt-3.5-turbo...

source: Please edit this script to insert your OpenAI API key!
it_it: Per favore, modifica lo script insendo la tua OpenAI API key!
